type ProductCreateManyInput = {
  id?: number;
  title: string;
  img: string;
  releaseDate: string;
  price: number;
  summary: string;
  publisher: string;
  author: string;
  pages: number;
  genre: string;
  language: string;
};

export const NOVEL: ProductCreateManyInput[] = [
  {
    // id: 1,
    title: "(LN) โปรดรังแกฉันที คุณนางร้าย! เล่ม 1",
    img: "imgs/services/โปรดรังแกฉันทีคุณนางร้าย-เล่ม1.jpg",
    releaseDate: "25-03-2024",
    price: 350,
    summary: `
      อีวาน เด็กสาวที่กลับชาติมาเกิดใหม่เป็นนางร้ายในเกม "ปีกแห่งหัวใจ" เธอพยายามที่จะหลีกเลี่ยงและไม่ยุ่งเกี่ยวกับนางเอก เพื่อไม่ให้ชะตากรรมของเธอจบลงเหมือนนางร้ายในเกมที่เธอเคยเล่นเมื่อชาติที่แล้ว
      ทว่า...เอลซ่า นางเอกของเกมกลับพยายามเข้าหานางร้ายอย่างอีวานและอ้อนวอนขอในสิ่งที่แปลกประหลาดที่สุด
      ‘ได้โปรดรังแกฉันเถอะ’ ความสัมพันธ์ที่ซับซ้อนและเข้าใจยากจึงได้เริ่มต้นขึ้น...
    `,
    publisher: "Lily House",
    author: "Akiyama Rei",
    pages: 350,
    genre: "แฟนตาซี/โรแมนติก",
    language: "ไทย",
  },
  {
    // id: 2,
    title: "เพื่อนรักของพี่ที่รักของฉัน เล่ม 1",
    img: "imgs/services/เพื่อนรักของพี่ที่รักของฉัน-เล่ม1.jpg",
    releaseDate: "01-02-2024",
    price: 300,
    summary: `
      เรื่องราวความรักที่ไม่ธรรมดาระหว่างน้องสาวของแฟนเพื่อนกับพี่สาวของเพื่อนที่เธอแอบหลงรักมาตลอด การเผชิญหน้ากับความรู้สึกที่แอบซ่อนอยู่และการต้องทำความเข้าใจในความรู้สึกของกันและกันจะเป็นอย่างไร...
    `,
    publisher: "Yuri World",
    author: "Hasegawa Yumi",
    pages: 320,
    genre: "โรแมนติก",
    language: "ไทย",
  },
  {
    // id: 3,
    title: "กระซิบรักเป็นทำนองร้องบอกเธอ เล่ม 1",
    img: "imgs/services/กระซิบรักเป็นทำนองร้องบอกเธอ-เล่ม1.jpg",
    releaseDate: "10-02-2024",
    price: 320,
    summary: `
      ยูริ นักดนตรีสาวผู้เงียบขรึมได้รับหน้าที่สอนเพลงให้กับนานา สาวน้อยที่สดใสและมีพรสวรรค์ด้านดนตรี ความใกล้ชิดทำให้เกิดความรู้สึกพิเศษที่เกินกว่าแค่ความสัมพันธ์ระหว่างครูและลูกศิษย์...
    `,
    publisher: "Yuri World",
    author: "Sato Akira",
    pages: 310,
    genre: "โรแมนติก/ดนตรี",
    language: "ไทย",
  },
  {
    // id: 4,
    title: "คุณเพื่อนคะ ลองมาแต่งงานกันมั้ย เล่ม 1",
    img: "imgs/services/คุณเพื่อนคะลองมาแต่งงานกันมั้ย-เล่ม1.jpg",
    releaseDate: "15-02-2024",
    price: 290,
    summary: `
      ฮานะและยูริเป็นเพื่อนสนิทที่เติบโตมาด้วยกัน วันหนึ่งยูริได้สารภาพรักและขอฮานะแต่งงาน ทั้งคู่ต้องเผชิญกับความคิดที่ไม่ตรงกัน และต้องหาทางทำให้ความสัมพันธ์นี้พัฒนาไปสู่ความรักที่แท้จริง...
    `,
    publisher: "Lily House",
    author: "Yamaguchi Kana",
    pages: 330,
    genre: "โรแมนติก",
    language: "ไทย",
  },
  {
    // id: 5,
    title: "ช่วยโอ๋ฉันที คุณฮินาโมริ! เล่ม 1",
    img: "imgs/services/ช่วยโอ๋ฉันทีคุณฮินาโมริ!-เล่ม1.jpg",
    releaseDate: "18-03-2024",
    price: 350,
    summary: `
      ฮินาโมริ นักเรียนหญิงที่เก่งทุกด้านแต่มีนิสัยเย็นชา ได้พบกับริคุ สาวน้อยผู้เป็นเพื่อนร่วมชั้นที่มีนิสัยน่ารักสดใส ริคุพยายามทุกวิถีทางเพื่อทำให้ฮินาโมริเปิดใจและยิ้มให้เธอได้สักครั้ง...
    `,
    publisher: "Yuri World",
    author: "Kawasaki Mei",
    pages: 340,
    genre: "โรแมนติก/คอมเมดี้",
    language: "ไทย",
  },
  {
    // id: 6,
    title: "ตำนานของแม่มดผู้ไม่อาจลืม เล่ม 1",
    img: "imgs/services/ตำนานของแม่มดผู้ไม่อาจลืม-เล่ม1.jpg",
    releaseDate: "25-04-2024",
    price: 380,
    summary: `
      เรื่องราวของแม่มดผู้ถูกสาปให้อยู่กับความทรงจำอันเจ็บปวดของอดีต และซากุระ เด็กสาวผู้มีความฝันที่จะเป็นแม่มดในอนาคต ทั้งคู่พบกันและเริ่มเรียนรู้ที่จะสร้างความทรงจำใหม่แทนที่ความเจ็บปวด...
    `,
    publisher: "Magic Yuri",
    author: "Fujimoto Haru",
    pages: 360,
    genre: "แฟนตาซี",
    language: "ไทย",
  },
  {
    // id: 7,
    title: "ถ้าเธอจะเลือกเขา เรามารักกันเองไหม",
    img: "imgs/services/ถ้าเธอจะเลือกเขาเรามารักกันเองไหม.jpg",
    releaseDate: "05-05-2024",
    price: 300,
    summary: `
      มาริ เด็กสาวผู้เป็นที่ชื่นชอบในกลุ่มเพื่อนตัดสินใจที่จะเผชิญหน้ากับอาโออิ เพื่อนที่เธอแอบรัก แต่กลับพบว่าอาโออิแอบชอบเพื่อนของเธอ ความรักที่ไม่สมหวังนี้ทำให้เธอต้องเลือกว่าจะเดินหน้าหรือหันกลับ...
    `,
    publisher: "Yuri World",
    author: "Tanaka Yumi",
    pages: 330,
    genre: "โรแมนติก",
    language: "ไทย",
  },
  {
    // id: 8,
    title: "ทำไงดีเกมนี้นางร้ายน่ารัก เล่ม 2",
    img: "imgs/services/ทำไงดีเกมนี้นางร้ายน่ารัก-เล่ม2.jpg",
    releaseDate: "15-06-2024",
    price: 360,
    summary: `
      ในเล่มที่ 2 ของเรื่องราวนี้ อานิเมะเกมที่ชื่นชอบเปลี่ยนแปลงไปเมื่อยูมิพยายามแก้ไขชะตากรรมของเธอและคนอื่น ๆ ที่เกี่ยวข้อง ทำให้ทุกสิ่งซับซ้อนมากขึ้น ความรักที่เริ่มพัฒนาทำให้เธอพบว่าการตัดสินใจสำคัญกว่าที่เคย...
    `,
    publisher: "Lily House",
    author: "Akiyama Rei",
    pages: 370,
    genre: "แฟนตาซี/โรแมนติก",
    language: "ไทย",
  },
  {
    // id: 9,
    title: "ฝ่าปริศนาตะลุยโลกเบื้องหลัง เล่ม 6",
    img: "imgs/services/ฝ่าปริศนาตะลุยโลกเบื้องหลัง-เล่ม6.jpg",
    releaseDate: "20-07-2024",
    price: 400,
    summary: `
      มิโกะและยูริต้องเผชิญหน้ากับปริศนาใหม่ที่พาพวกเธอเข้าสู่โลกเบื้องหลังที่เต็มไปด้วยความลับ ทั้งคู่ต้องทำงานร่วมกันเพื่อค้นหาความจริงที่ซ่อนอยู่ และเรียนรู้ที่จะเชื่อมั่นและพึ่งพาซึ่งกันและกัน...
    `,
    publisher: "Mystery Yuri",
    author: "Nakajima Kaito",
    pages: 380,
    genre: "แฟนตาซี/ผจญภัย",
    language: "ไทย",
  },
  {
    // id: 10,
    title: "รอยจูบนั้นที่ฉันโหยหา-เล่ม1",
    img: "imgs/services/รอยจูบนั้นที่ฉันโหยหา-เล่ม1.jpg",
    releaseDate: "30-08-2024",
    price: 120,
    summary: `
      เรื่องราวของนัตสึกิที่ต้องเผชิญกับความรักที่ซับซ้อนและการขัดแย้งระหว่างความรักกับการทำธุรกิจในร้านเหล้ายาดองที่เธอทำงานอยู่ การเปลี่ยนแปลงและความท้าทายที่เธอพบจะเป็นอย่างไร...
    `,
    publisher: "lily house",
    author: "Miyuki Yorita",
    pages: 370,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 11,
    title: "รักใครหัวใจสีชมพู เล่ม 1",
    img: "imgs/services/รักใครหัวใจสีชมพู-เล่ม1.jpg",
    releaseDate: "15-08-2024",
    price: 340,
    summary: `
    ฮารุกะ สาวที่ชอบเก็บตัวและไม่ค่อยเข้าสังคม กลับตกหลุมรักมายู ที่เป็นเพื่อนร่วมชั้น ทั้งคู่เริ่มต้นด้วยความไม่เข้าใจ แต่ความรักที่พัฒนาขึ้นจะทำให้พวกเธอใกล้ชิดกันมากขึ้น...
  `,
    publisher: "Yuri World",
    author: "Miyuki Yorita",
    pages: 320,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 12,
    title: "ฤดูร้อนผลิรักของเราสอง เล่ม 1",
    img: "imgs/services/ฤดูร้อนผลิรักของเราสอง-เล่ม1.jpg",
    releaseDate: "01-09-2024",
    price: 330,
    summary: `
    การเดินทางไปที่รีสอร์ทในช่วงฤดูร้อนทำให้มิกิและเรนพบกับความรักที่ไม่คาดคิด ทั้งคู่ต้องเผชิญกับความรู้สึกที่เติบโตในช่วงเวลาที่ใกล้ชิดและค้นหาความรักที่แท้จริงของกันและกัน...
  `,
    publisher: "Lily House",
    author: "Miyuki Yorita",
    pages: 295,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 13,
    title: "หากว่ารักมองเห็นได้ด้วยตา เล่ม 1",
    img: "imgs/services/หากว่ารักมองเห็นได้ด้วยตา-เล่ม1.jpg",
    releaseDate: "10-09-2024",
    price: 355,
    summary: `
    ซายากะ สาวที่มีความสามารถพิเศษในการเห็นสายใยแห่งรักของคนอื่น ได้พบกับอาซึมิ ผู้ที่เธอไม่สามารถมองเห็นได้ชัดเจน ความลึกลับของความรู้สึกและความรักที่มองไม่เห็นได้กลายเป็นเรื่องที่ต้องไขปริศนา...
  `,
    publisher: "Mystery Yuri",
    author: "Miyuki Yorita",
    pages: 310,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 14,
    title: "อยู่ท่ามกลางทุ่งลิลี่รู้ตัวอีกทีก็เผลอเหมาสองซะแล้ว - เล่ม 2",
    img: "imgs/services/อยู่ท่ามกลางทุ่งลิลี่รู้ตัวอีกทีก็เผลอเหมาสองซะแล้ว-เล่ม2.jpg",
    releaseDate: "25-09-2024",
    price: 370,
    summary: `
    คานาโกะ เด็กสาวผู้เงียบขรึมและมักเก็บตัว ได้เข้ามาสู่วิทยาลัยที่เต็มไปด้วยความสดใสของเหล่าสาวน้อยทั้งหลาย เมื่อเธอได้พบกับสองสาวที่ทำให้หัวใจเธอสั่นไหว ทั้งความสนุกสนานและความรักก็เริ่มต้นขึ้น...
  `,
    publisher: "Yuri World",
    author: "Miyuki Yorita",
    pages: 280,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 15,
    title: "รักใครหัวใจสีชมพู เล่ม 2",
    img: "imgs/services/รักใครหัวใจสีชมพู-เล่ม2.jpg",
    releaseDate: "05-10-2024",
    price: 365,
    summary: `
    ริกะและมิโฮะเพื่อนรักสองคนที่ไม่เคยคิดว่าความสัมพันธ์ของพวกเธอจะเปลี่ยนไป ความรักที่ซับซ้อนระหว่างพวกเธอกลายเป็นเรื่องที่ต้องเผชิญหน้ากับความจริงและหาทางออกของหัวใจ...
  `,
    publisher: "Complicated Yuri",
    author: "Miyuki Yorita",
    pages: 360,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 16,
    title: "ทำไงดีเกมนี้นางร้ายน่ารัก เล่ม 4",
    img: "imgs/services/ทำไงดีเกมนี้นางร้ายน่ารัก-เล่ม4.jpg",
    releaseDate: "05-10-2024",
    price: 365,
    summary: `
    การเดินทางของอีวานและเอลซ่ากำลังเข้มข้นขึ้นในเล่มนี้ การเผชิญหน้ากับปัญหาที่ใหญ่ขึ้นและความรักที่เริ่มก่อตัวเป็นเรื่องที่ต้องติดตาม...
  `,
    publisher: "Complicated Yuri",
    author: "Miyuki Yorita",
    pages: 320,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 17,
    title: "ทำไงดีเกมนี้นางร้ายน่ารัก เล่ม 5",
    img: "imgs/services/ทำไงดีเกมนี้นางร้ายน่ารัก-เล่ม-5.jpg",
    releaseDate: "05-10-2024",
    price: 365,
    summary: `
    การเดินทางของอีวานและเอลซ่ากำลังเข้มข้นขึ้นในเล่มนี้ การเผชิญหน้ากับปัญหาที่ใหญ่ขึ้นและความรักที่เริ่มก่อตัวเป็นเรื่องที่ต้องติดตาม...
  `,
    publisher: "Complicated Yuri",
    author: "Miyuki Yorita",
    pages: 330,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 18,
    title: "เพื่อนรักของพี่ที่รักของฉัน เล่ม 2",
    img: "imgs/services/เพื่อนรักของพี่ที่รักของฉัน-เล่ม2.jpg",
    releaseDate: "05-10-2024",
    price: 365,
    summary: `
    เรื่องราวของริกะและมิโฮะยังคงดำเนินต่อไปในเล่มนี้ การเผชิญหน้ากับความรักที่ซับซ้อนและการเปลี่ยนแปลงที่เกิดขึ้นในความสัมพันธ์ระหว่างพวกเขา...
  `,
    publisher: "Complicated Yuri",
    author: "Miyuki Yorita",
    pages: 315,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 19,
    title: "ช่วยโอ๋ฉันทีคุณฮินาโมริ! เล่ม 2",
    img: "imgs/services/ช่วยโอ๋ฉันทีคุณฮินาโมริ!-เล่ม2.jpg",
    releaseDate: "05-10-2024",
    price: 365,
    summary: `
    ฮินาโมริและริคุยังคงพัฒนาความสัมพันธ์ในเล่มนี้ การเผชิญหน้ากับความรู้สึกที่สับสนและการเปิดใจให้กันเป็นเรื่องที่น่าติดตาม...
  `,
    publisher: "Complicated Yuri",
    author: "Miyuki Yorita",
    pages: 310,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
  {
    // id: 20,
    title: "โปรดรังแกฉันทีคุณนางร้าย เล่ม 2",
    img: "imgs/services/โปรดรังแกฉันทีคุณนางร้าย-เล่ม2.jpg",
    releaseDate: "05-10-2024",
    price: 365,
    summary: `
    อีวานและเอลซ่ามาถึงจุดสำคัญในความสัมพันธ์ของพวกเขา การตัดสินใจที่สำคัญและความรู้สึกที่ลึกซึ้งกำลังเป็นเรื่องที่ต้องเผชิญ...
  `,
    publisher: "Complicated Yuri",
    author: "Miyuki Yorita",
    pages: 300,
    genre: "โรแมนติก/ดราม่า",
    language: "ไทย",
  },
];
